# Lesson 10 Activity: Working with Pandas

## Learning Objectives

By the end of this activity, you will be able to:
- Create Pandas Series and DataFrames
- Load data from CSV files
- Perform basic data exploration and analysis
- Calculate descriptive statistics
- Filter and manipulate DataFrame data

## Tips

- **Creating DataFrames:** Use `pd.DataFrame(dictionary)` where dictionary keys become column names
- **Loading CSV files:** Use `pd.read_csv('filename.csv')`
- **Basic exploration:** Use `.head()`, `.tail()`, `.info()`, `.describe()`, and `.shape`
- **Filtering data:** Use conditions like `df[df['column'] > value]`
- **Column selection:** Use `df['column_name']` or `df[['col1', 'col2']]`
- **Adding columns:** Use `df['new_column'] = calculation`
- **Statistics:** Use `.mean()`, `.max()`, `.min()`, `.sum()` methods

**Remember:** Take your time with each step and test your code frequently!

In [3]:
import pandas as pd
import numpy as np

---
## Problem 1: Creating Your First DataFrame

**Scenario:** You're working at a bookstore and need to create a simple inventory system.

**Your Task:**
1. Create a DataFrame called `books_df` with the following data:
   - Book titles: ["Python Basics", "Data Science Handbook", "Web Development Guide"]
   - Authors: ["John Smith", "Jane Doe", "Mike Johnson"]
   - Prices: [29.99, 45.50, 35.00]
   - Stock: [15, 8, 12]

2. Display the DataFrame
3. Print the shape of the DataFrame
4. Display basic information about the DataFrame using `.info()`

In [18]:
# Problem 1: Create your DataFrame here

# Step 1: Create the DataFrame
data = {
    'book_titles': ['Python Basics', 'Data Science Handbook', 'Web Development Guide'],
    'authors': ['John Smith', 'Jane Doe', 'Mike Johnson'],
    'prices': [29.99, 45.50, 35.00],
    'stock': [15, 8, 12]
}

books_df = pd.DataFrame(data)

# Step 2: Display the DataFrame

books_df

             book_titles       authors  prices  stock
0          Python Basics    John Smith   29.99     15
1  Data Science Handbook      Jane Doe   45.50      8
2  Web Development Guide  Mike Johnson   35.00     12

In [17]:
# Step 3: Print the shape

print(books_df.shape)

# Step 4: Display info

print(books_df.describe())

(3, 4)
          prices      stock
count   3.000000   3.000000
mean   36.830000  11.666667
std     7.915283   3.511885
min    29.990000   8.000000
25%    32.495000  10.000000
50%    35.000000  12.000000
75%    40.250000  13.500000
max    45.500000  15.000000

---
## Problem 2: Loading and Exploring Student Data

**Scenario:** You're a teacher analyzing student performance data.

**Your Task:**
1. Load the `students.csv` file into a DataFrame called `students_df`
2. Display the first 3 rows using `.head()`
3. Display the last 2 rows using `.tail()`
4. Show descriptive statistics for numerical columns using `.describe()`
5. Find the average grade of all students

In [3]:
# Problem 2: Load and explore student data
import csv

# Step 1: Load the CSV file

try:
    with open('students.csv') as studentsCSV:
        dictReader = csv.DictReader(studentsCSV)
        studentRows = list(dictReader)
        students_df = pd.DataFrame(studentRows)
except Exception as e:
    print(f'Unexpected error: {e}')
finally:
    studentsCSV.close()

students_df

Unexpected error: name 'pd' is not defined

NameError: name 'students_df' is not defined

In [ ]:
# Step 2: Display first 3 rows

students_df.head(3)

      name age grade  subject
0    Alice  20    85     Math
1      Bob  19    92  Science
2  Charlie  21    78     Math

In [ ]:
# Step 3: Display last 2 rows

students_df.tail(2)

    name age  grade  subject
6  Grace  20     90     Math
7  Henry  21     87  Science

In [ ]:
# Step 4: Show descriptive statistics

students_df.describe()

           grade
count   8.000000
mean   87.125000
std     5.462535
min    78.000000
25%    84.250000
50%    87.500000
75%    90.500000
max    95.000000

In [ ]:
# Step 5: Calculate average grade

# The issue here is recovering the data from a dict reader returns everything as a string, we have to convert all values of the column we want to numeric
# Otherwise the pd.mean() function will concatenate all string values and then try to do the mean which returns typeError
students_df['grade'] = pd.to_numeric(students_df['grade'])  
students_df['grade'].mean()

np.float64(87.125)

---
## Problem 3: Data Filtering and Selection

**Scenario:** Continue working with the student data to find specific information.

**Your Task:**
1. Display only the 'name' and 'grade' columns from `students_df`
2. Find all students who scored above 85
3. Find all students studying 'Math'
4. Find the highest grade in the dataset
5. Count how many students are in each subject

In [ ]:
# Problem 3: Filter and select data

# Step 1: Display only name and grade columns

students_df[['name', 'grade']]

      name  grade
0    Alice     85
1      Bob     92
2  Charlie     78
3    Diana     88
4      Eva     95
5    Frank     82
6    Grace     90
7    Henry     87

In [ ]:
# Step 2: Students with grades above 85

# students_df['grade'] = pd.to_numeric(students_df['grade'])
students_df[students_df['grade'] > 85]

    name age  grade  subject
1    Bob  19     92  Science
3  Diana  20     88  Science
4    Eva  19     95     Math
6  Grace  20     90     Math
7  Henry  21     87  Science

In [ ]:
# Step 3: Students studying Math

students_df[students_df['subject'] == 'Math']

      name age  grade subject
0    Alice  20     85    Math
2  Charlie  21     78    Math
4      Eva  19     95    Math
6    Grace  20     90    Math

In [ ]:
# Step 4: Highest grade

students_df[students_df['grade'] == students_df['grade'].max()]

  name age  grade subject
4  Eva  19     95    Math

In [ ]:
# Step 5: Count students by subject

students_df[['subject']].value_counts()

subject
Math       4
Science    4
Name: count, dtype: int64

---
## Problem 4: Sales Data Analysis

**Scenario:** You're analyzing sales data for an electronics store.

**Your Task:**
1. Load the `sales.csv` file into a DataFrame called `sales_df`
2. Calculate the total value for each product (price Ã— quantity)
3. Add this as a new column called 'total_value' to the DataFrame
4. Find the product with the highest total value
5. Calculate the grand total of all sales

In [4]:
# Problem 4: Sales data analysis

import csv

# Step 1: Load the sales data

try:
    with open('sales.csv') as salesCSV:
        dictReader = csv.DictReader(salesCSV)
        salesRows = list(dictReader)
        sales_df = pd.DataFrame(salesRows)
except Exception as e:
    print(f'Unexpected error: {e}')
finally:
    salesCSV.close()

sales_df

      product   price quantity        date
0      Laptop  999.99        5  2024-01-15
1       Mouse   25.50       20  2024-01-15
2    Keyboard   75.00       15  2024-01-16
3     Monitor  299.99        8  2024-01-16
4  Headphones   59.99       12  2024-01-17

In [ ]:
# Step 2 & 3: Calculate total value and add as new column

sales_df['total'] = sales_df['price'].astype(np.float64) * sales_df['quantity'].astype(np.int32)

In [ ]:
# Step 4: Find product with highest total value


# Step 5: Calculate grand total of all sales

---
## Problem 5: Series Creation and Manipulation

**Scenario:** Create and work with Pandas Series for daily temperature data.

**Your Task:**
1. Create a Pandas Series called `temperatures` with the following data:
   - Values: [22, 25, 23, 26, 24, 27, 25]
   - Index: ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun']
2. Find the temperature for Wednesday
3. Find days with temperature above 24 degrees
4. Calculate the average temperature for the week
5. Find the day with the highest temperature

In [8]:
# Problem 5: Series creation and manipulation

# Step 1: Create the temperature series

temp = pd.Series([22, 25, 23, 26, 24, 27, 25], index=['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'])
temp

Mon    22
Tue    25
Wed    23
Thu    26
Fri    24
Sat    27
Sun    25
dtype: int64

In [9]:
# Step 2: Temperature for Wednesday

temp['Wed']

np.int64(23)

In [10]:
# Step 3: Days with temperature above 24

f_temp = pd.Series()
f_temp = temp.where(temp > 24).dropna()
f_temp

Tue    25.0
Thu    26.0
Sat    27.0
Sun    25.0
dtype: float64

In [11]:
# Step 4: Average temperature

round(temp.mean(0), 2)

np.float64(24.57)

In [12]:
# Step 5: Day with highest temperature

temp.idxmax()

'Sat'

---
## Reflection Questions

Please answer these questions after completing the activity:

1. **What is the difference between a Pandas Series and a DataFrame?**
   
   *Your answer:*

2. **What are the advantages of using Pandas over working with plain Python lists and dictionaries?**
   
   *Your answer:*

3. **Describe a real-world scenario where you might use the filtering techniques you learned in Problem 3.**
   
   *Your answer:*

4. **What did you find most challenging about working with Pandas in this activity?**
   
   *Your answer:*